{
  "backend/main.mo": "Motoko actor implementing a job queue system for AI processing tasks with job submission, status tracking, caching, device profiles, performance metrics, and fallback configuration; some methods trap after upgrade.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of frontend components including editor store, rendering engines, timeline/preview/inspector UI, project management, AI tools, and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI elements like background, foreground, cards, borders, and charts.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the EditorApp.",
  "frontend/src/App.tsx": "Root React component rendering Router and Toaster components for navigation and toast notifications.",
  "frontend/src/components/AIAssistant.tsx": "AI chat assistant component with message history, quick commands for editing tasks (cinematic, viral reel, effects), autocomplete, command history persistence, and integration with aiKnowledgeBase and mockChatHelp service.",
  "frontend/src/components/AIJobStatus.tsx": "Component displaying AI job status with progress tracking, categorized job types (generation, editing, enhancement, creator, assistant, growth, experimental) mapped to icons and labels, using useAIJob hook and UI components.",
  "frontend/src/components/AIToolCard.tsx": "A clickable card component that displays AI tool information with name, description, category badge, and icon, using category-specific colors and hover effects.",
  "frontend/src/components/DesktopPhotoEditor.tsx": "Desktop layout for photo editing with a top menu bar, central canvas area for image display, file upload functionality, and right sidebar containing filters and stickers panels.",
  "frontend/src/components/DesktopVideoEditor.tsx": "Desktop video editor layout with top menu bar, left preview panel, right panels for layers and effects (Inspector), and bottom timeline component.",
  "frontend/src/components/ExportModal.tsx": "Modal dialog for exporting video projects with format selection (JSON, video, GIF, images), project info display, progress tracking, and export execution functionality.",
  "frontend/src/components/FiltersPanel.tsx": "Photo editor panel with sliders for adjusting brightness, contrast, saturation, and blur filters, including a reset button to restore default values.",
  "frontend/src/components/HomeOptionCard.tsx": "Animated card component for home page navigation with 3D hover effects, neon glow styling, and icon display.",
  "frontend/src/components/Inspector.tsx": "Properties panel for editing selected video clips, including timing controls, transform properties with keyframe management, and integration with CoreEngine for rendering.",
  "frontend/src/components/MobileBottomNav.tsx": "Fixed bottom navigation bar for mobile devices with tabs for Create, Templates, AI, and Projects, showing active state highlighting.",
  "frontend/src/components/MobilePhotoEditor.tsx": "Mobile-optimized photo editor component with file upload, PhotoCanvas display, and quick filter buttons (brightness, contrast, saturation, blur) in a vertical layout.",
  "frontend/src/components/MobileVideoEditor.tsx": "Mobile video editor UI with video preview, timeline, and toolbar buttons for trim, split, text, stickers, music, and AI features in a vertical layout.",
  "frontend/src/components/NavbarDesktop.tsx": "Fixed left sidebar navigation for desktop with links to Create, Templates, AI Tools, Projects, and Account sections, plus logo and footer with caffeine.ai attribution.",
  "frontend/src/components/PageTransition.tsx": "Simple wrapper component that applies fade-in animation and 3D perspective transforms to page transitions.",
  "frontend/src/components/PhotoCanvas.tsx": "Canvas-based photo editor that renders images with CSS filters (brightness, contrast, saturation, blur) and text stickers, exposing export functionality via forwardRef.",
  "frontend/src/components/Preview.tsx": "Three.js-based preview component that renders video/image/text/shape clips from timeline tracks with transforms, using CoreEngine and TimelineEngine for playback.",
  "frontend/src/components/ProjectsModal.tsx": "Modal dialog for loading saved projects, displaying a scrollable list of projects with load buttons or empty state message.",
  "frontend/src/components/RecentProjects.tsx": "Horizontal scrollable list of recent projects with timestamps, allowing users to click and load projects into the video editor.",
  "frontend/src/components/SearchBar.tsx": "Search input with clear button and filter dropdown (All, Templates, AI Tools, Quick Tools) for filtering content across the application.",
  "frontend/src/components/StickersPanel.tsx": "Displays a grid of emoji stickers that can be added to the photo editor canvas at a default position (400, 300) with 64x64 dimensions.",
  "frontend/src/components/TemplateCard.tsx": "A hoverable template card component with gradient background, thumbnail support, play icon overlay, and navigation to the video editor on click.",
  "frontend/src/components/ThreeBackground.tsx": "Renders an animated Three.js background with particles and geometric shapes (torus, octahedron, box) that rotate continuously, with mobile-optimized particle counts.",
  "frontend/src/components/Timeline.tsx": "Video editor timeline component with time ruler, draggable clips across multiple tracks, playhead indicator, and clip selection/deletion functionality.",
  "frontend/src/components/Toolbar.tsx": "Main editor toolbar with playback controls, media upload, add text/shape buttons, project management, export options, and FPS/resolution settings.",
  "frontend/src/components/VideoPlayer.tsx": "Controlled video player component with play/pause button, time tracking callbacks, and imperative handle for external playback control via ref.",
  "frontend/src/data/aiKnowledgeBase.ts": "Knowledge base defining AI tools (image/video generation, auto-cut, subtitles, enhance, upscale), editor features, workflows, and troubleshooting information for context-aware help.",
  "frontend/src/data/homeSections.ts": "Exports static configuration for home page sections including quick actions (Create New, Templates, AI Tools) and a comprehensive list of 19 AI tools organized by category (generation, editing, enhancement, growth, assistant).",
  "frontend/src/data/templates.ts": "Defines Template interface and exports 6 pre-made video templates across categories (Social Media, Business, Gaming, Vlog, Product) with metadata like duration and description.",
  "frontend/src/engine/CoreEngine.ts": "Core rendering engine that interpolates clip transforms (position, scale, rotation, opacity) using keyframes and orchestrates the complete frame rendering pipeline across Timeline, Keyframe, and Effect engines.",
  "frontend/src/engine/EffectEngine.ts": "Manages visual effects with implementations for blur (box blur) and color adjustments (brightness, contrast, saturation) applied to ImageData pixel arrays.",
  "frontend/src/engine/ExportEngine.ts": "Handles project export in multiple formats (video, gif, images, json) by rendering frames sequentially using CoreEngine and reporting progress callbacks.",
  "frontend/src/engine/KeyframeEngine.ts": "Provides linear interpolation function for keyframe animation values based on time, finding previous and next keyframes to calculate intermediate values.",
  "frontend/src/engine/TimelineEngine.ts": "Manages timeline operations by querying tracks to find all clips active at a given time point.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, automatically recreating it when Internet Identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useAIJob.ts": "React hook for submitting AI jobs to backend, polling job status every 2 seconds, and handling completion with category-specific actions (adding to asset library, integrating results, etc.) using React Query and toast notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing AuthClient lifecycle, login/logout flows, identity persistence, and providing authentication status states.",
  "frontend/src/hooks/useMediaQuery.ts": "React hook that tracks CSS media query matches using window.matchMedia API with event listeners for responsive design.",
  "frontend/src/hooks/useProjectManager.ts": "Custom hook for managing video editor projects using localStorage, providing functions to save/load projects with tracks, clips, duration, fps, and resolution data.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating that main query logic is handled in useProjectManager.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using OKLCH color space, plus utility classes for glass morphism effects and scrollbar hiding.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/ai/AutoCutWizard.tsx": "Three-step wizard interface for uploading videos, selecting editing styles, and processing automatic video cuts with progress tracking.",
  "frontend/src/pages/ai/AutoEnhance.tsx": "AI-powered video/audio enhancement page with toggleable options for color correction, sharpening, denoising, noise removal, voice boost, and normalization.",
  "frontend/src/pages/ai/AutoUpscale.tsx": "React component for AI-powered video/image upscaling with resolution selection (1080p/4K/8K), face preservation, and noise reduction options. Includes file upload, configuration panel, and preview functionality using the useAIJob hook.",
  "frontend/src/pages/ai/BackgroundRemoveWizard.tsx": "Three-step wizard component for removing backgrounds from videos with interactive canvas tools (brush/eraser), progress tracking, and before/after slider comparison. Includes file upload and processing steps.",
  "frontend/src/pages/ai/BeatSyncWizard.tsx": "Three-step wizard for synchronizing video edits to music beats. Handles video and audio file uploads, BPM configuration, and intensity settings (subtle/moderate/aggressive) with progress tracking.",
  "frontend/src/pages/ai/BRollGenerate.tsx": "React component for generating cinematic B-roll footage using AI based on text descriptions. Allows configuration of duration, style (cinematic/documentary/commercial/vlog), resolution, and transition type.",
  "frontend/src/pages/ai/CaptionsWizard.tsx": "Three-step wizard for generating automatic captions on videos. Includes video upload, caption customization (language, font, position), and processing with progress indication.",
  "frontend/src/pages/ai/CharacterGenerate.tsx": "React component for generating consistent character designs with AI, allowing users to specify description, style, poses, and consistency mode. Submits character generation jobs via useAIJob hook and displays results with download functionality.",
  "frontend/src/pages/ai/HDREnhance.tsx": "React component for HDR enhancement of images/videos with configurable intensity and tone mapping options. Handles file uploads and submits HDR enhancement jobs through the useAIJob hook.",
  "frontend/src/pages/ai/HighlightDetect.tsx": "React component for automatically detecting highlights in videos based on criteria like loudness, motion, faces, and scene changes. Uploads videos and submits detection jobs via useAIJob hook.",
  "frontend/src/pages/ai/HookGenerate.tsx": "React component for generating attention-grabbing video hooks based on video description, target audience, and hook style. Submits hook generation jobs and displays copyable results.",
  "frontend/src/pages/ai/ImageGenerator.tsx": "React component for generating images from text prompts with configurable size and style options. Features a Three.js background, navigation components, and submits image generation jobs via useAIJob hook.",
  "frontend/src/pages/ai/LogoGenerate.tsx": "React component for AI-powered logo generation with inputs for brand name, style, colors, and icon preferences. Displays generated logos in a grid with download functionality.",
  "frontend/src/pages/ai/MotionAI.tsx": "React component for auto-generating keyframe animations on video clips. Allows selection of clip ID and animation property (position, scale, rotation, opacity).",
  "frontend/src/pages/ai/MusicGenerate.tsx": "React component for AI music generation with controls for prompt, duration, BPM, genre, and mood. Displays generated music track with playback and download options.",
  "frontend/src/pages/ai/StickerGenerate.tsx": "React component for generating custom stickers using AI with options for prompt, style, size, and background. Shows generated sticker with download capability.",
  "frontend/src/pages/ai/TimelineAI.tsx": "React component for getting AI-powered timeline suggestions (cuts, effects, zooms) based on video URL and optional project ID.",
  "frontend/src/pages/ai/TitleGenerate.tsx": "React component for generating video titles using AI with inputs for video description, platform, tone, and keywords. Displays multiple title suggestions with copy functionality.",
  "frontend/src/pages/ai/VideoGenerator.tsx": "React component for AI video generation with prompt input, duration slider, aspect ratio selection, and integration with useAIJob hook to submit video.generate jobs.",
  "frontend/src/pages/ai/VoiceClone.tsx": "React component for voice cloning that allows audio file upload, script input, stability/similarity sliders, and submits voice.clone jobs via useAIJob hook.",
  "frontend/src/pages/ComingSoon.tsx": "Reusable page component displaying a \"coming soon\" message for features under development with navigation back to home.",
  "frontend/src/pages/Home.tsx": "Main landing page with search, recent projects, create options (video/photo/AI), and categorized AI tools with expandable sections.",
  "frontend/src/pages/PhotoEditor.tsx": "Photo editor page that conditionally renders desktop or mobile photo editor components based on screen size.",
  "frontend/src/pages/VideoEditor.tsx": "Video editor page with toolbar, project/export modals, AI assistant, and responsive desktop/mobile layouts.",
  "frontend/src/Router.tsx": "TanStack Router configuration with lazy-loaded routes for home, video/photo editors, and 20+ AI tool pages including image/video generation, auto-cut, captions, enhancement, and voice cloning.",
  "frontend/src/services/aiService.ts": "AI service layer providing provider configuration (mock/replicate/runway/etc.), API request handling with retry logic and timeout, and mock AI functions that return placeholder data for all 50+ AI job types.",
  "frontend/src/shaders/basic.glsl.ts": "Basic GLSL vertex and fragment shaders for WebGL rendering with brightness and time uniforms.",
  "frontend/src/store/editorStore.ts": "Zustand store managing video editor state including timeline tracks, clips with keyframe transforms/effects, playback controls, and CRUD operations for clips.",
  "frontend/src/store/photoEditorStore.ts": "Zustand store for photo editing state managing image URL, filters (brightness/contrast/saturation/blur), and stickers with position/size properties.",
  "frontend/src/types/aiJob.ts": "TypeScript type definitions for 50+ AI job types and their payload interfaces covering generation, editing, enhancement, creator tools, assistant commands, growth tools, and experimental features.",
  "frontend/src/types/aiTypes.ts": "Shared TypeScript types for AI job lifecycle (status, results, progress) and provider configuration (mock/replicate/huggingface) with subtitle and cut point interfaces.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, dark mode support, custom animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing a professional video editor with timeline engine, keyframe animations, WebGL rendering, AI orchestration across 8 categories (Generation, Editing, Enhancement, Creator, Assistant, Growth, Experimental, System), CapCut-inspired home page, and Motoko backend for ICP persistence."
}