{
  "backend/main.mo": "Main Motoko actor implementing job queue system with job submission, status tracking, and result retrieval; includes deprecated device registration and fallback methods that trap after migration.",
  "backend/migration.mo": "Migration module that preserves jobQueueMap and nextJobId state during canister upgrades by copying old actor state to new actor structure.",
  "feature_evidence.json": "Feature evidence report documenting implementation requirements for aiService.ts mock functions, API integrations, and useAIJob hook for all 50+ job types with detailed specifications.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including editor components, engines, hooks, and AI tool pages with track-based timeline, WebGL preview, and localStorage project management.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables including sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the EditorApp application.",
  "frontend/src/App.tsx": "Root React component rendering TanStack RouterProvider with Toaster component for global toast notifications.",
  "frontend/src/components/AIAssistant.tsx": "AI chat assistant component with message history, quick commands, autocomplete, command history persistence, and integration with mockChatHelp service for contextual help.",
  "frontend/src/components/AIJobStatus.tsx": "Displays AI job status with categorized job types (generation, editing, enhancement, creator, assistant, growth, experimental), showing progress, logs, and filtering options using icons and badges.",
  "frontend/src/components/AIToolCard.tsx": "Renders a clickable card for AI tools with category-specific colors and glow effects, displaying tool name, description, icon, and category badge.",
  "frontend/src/components/ExportModal.tsx": "Modal dialog for exporting video projects with format selection (JSON, video, GIF, images), displaying project info (resolution, fps, duration) and export progress.",
  "frontend/src/components/HomeOptionCard.tsx": "Interactive card component with 3D hover effects and neon glow styling that navigates to specified routes when clicked.",
  "frontend/src/components/Inspector.tsx": "Property inspector panel for editing selected clip properties including timing, transform keyframes (position, scale, rotation, opacity), with add/delete keyframe controls.",
  "frontend/src/components/MobileBottomNav.tsx": "Fixed bottom navigation bar for mobile devices with tabs for Create, Templates, AI, and Projects, showing active state highlighting.",
  "frontend/src/components/NavbarDesktop.tsx": "Fixed left sidebar navigation for desktop with logo, navigation items (Create, Templates, AI Tools, Projects, Account), and footer with attribution link.",
  "frontend/src/components/PageTransition.tsx": "Wrapper component that applies fade-in animation and 3D perspective transforms to page content during transitions.",
  "frontend/src/components/Preview.tsx": "Renders a 3D preview canvas using React Three Fiber that displays active clips (video, image, text, shape) from the timeline with transforms applied by CoreEngine and TimelineEngine.",
  "frontend/src/components/ProjectsModal.tsx": "A modal dialog component that displays a scrollable list of saved projects and allows users to load a selected project into the editor.",
  "frontend/src/components/RecentProjects.tsx": "Displays a horizontal scrollable list of recent projects with timestamps, allowing users to click and load a project into the video editor.",
  "frontend/src/components/SearchBar.tsx": "A search input component with filter dropdown (All, Templates, AI Tools, Quick Tools) for searching templates and tools.",
  "frontend/src/components/TemplateCard.tsx": "A hoverable template card component that displays template metadata (name, category, duration, thumbnail) and navigates to the video editor on click.",
  "frontend/src/components/ThreeBackground.tsx": "Renders an animated 3D background using React Three Fiber with particles and geometric shapes (torus, octahedron, box) that rotate over time, with mobile optimization.",
  "frontend/src/components/Timeline.tsx": "A timeline editor component that displays tracks with draggable clips, time ruler, playhead, and supports clip selection, repositioning, and deletion.",
  "frontend/src/components/Toolbar.tsx": "Main toolbar component providing playback controls, media upload, text/shape creation, AI tools access, project management, and project settings (FPS, resolution) via a popover.",
  "frontend/src/data/aiKnowledgeBase.ts": "Defines structured knowledge base for AI assistant including tool descriptions (image/video generation, auto-cut, subtitles, enhance, upscale), editor features, workflows, and troubleshooting information.",
  "frontend/src/data/homeSections.ts": "Exports configuration for home page sections including quick actions and a comprehensive list of 19 AI tools categorized by function (generation, editing, enhancement, growth, assistant).",
  "frontend/src/data/templates.ts": "Defines template data structure and exports six pre-made video templates across categories (Social Media, Business, Gaming, Vlog, Product) with metadata like duration and description.",
  "frontend/src/engine/CoreEngine.ts": "Core rendering engine that interpolates clip transforms (position, scale, rotation, opacity) at given time and orchestrates frame rendering across the timeline.",
  "frontend/src/engine/EffectEngine.ts": "Handles visual effects application to image data, implementing blur and color adjustment effects (brightness, contrast, saturation) with pixel-level manipulation.",
  "frontend/src/engine/ExportEngine.ts": "Manages project export to multiple formats (video, gif, images, json) by rendering frames sequentially using CoreEngine and reporting progress.",
  "frontend/src/engine/KeyframeEngine.ts": "Provides linear interpolation function for keyframe animation, calculating values between keyframes based on time position.",
  "frontend/src/engine/TimelineEngine.ts": "Manages timeline logic by determining which clips across all tracks are active at a given time point.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAIJob.ts": "React hook for submitting AI jobs to backend actor, polling job status, and handling completion with category-specific notifications and result integration.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP integration, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useProjectManager.ts": "Manages video editor projects using localStorage (not backend), providing functions to save/load projects with tracks, clips, duration, fps, and resolution data via React Query mutations.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file with a comment indicating main queries are handled in useProjectManager.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using OKLCH color space, defining design tokens for backgrounds, borders, and UI elements, plus utility classes for glass morphism and scrollbar hiding.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/ai/AutoCutWizard.tsx": "Multi-step wizard interface for automatic video cutting feature with file upload, style selection, and progress tracking steps.",
  "frontend/src/pages/ai/AutoEnhance.tsx": "React component for auto-enhancing video and audio quality with configurable options for color correction, sharpening, denoising, noise removal, voice boost, and normalization. Allows file upload, preview, and submits enhancement jobs via useAIJob hook.",
  "frontend/src/pages/ai/AutoUpscale.tsx": "React component for AI-powered media upscaling to 1080p, 4K, or 8K resolutions with options for face preservation and noise reduction. Handles file upload, preview, and submits upscale jobs via useAIJob hook.",
  "frontend/src/pages/ai/BackgroundRemoveWizard.tsx": "Three-step wizard component for removing backgrounds from videos with file upload, manual refinement tools (brush/eraser), and progress tracking. Includes slider for before/after comparison and navigation controls.",
  "frontend/src/pages/ai/BeatSyncWizard.tsx": "Three-step wizard component for synchronizing video edits to music beats with video and audio file uploads, BPM configuration, and intensity settings (subtle, moderate, aggressive). Includes progress tracking and step navigation.",
  "frontend/src/pages/ai/BRollGenerate.tsx": "React component for generating AI-driven B-roll footage based on text descriptions with configurable duration, style (cinematic, documentary, commercial, vlog), resolution, and transition type. Submits generation jobs via useAIJob hook.",
  "frontend/src/pages/ai/CaptionsWizard.tsx": "A multi-step wizard component for uploading videos and configuring automatic caption generation with language, font, and position settings. Includes progress tracking and a simulated processing step.",
  "frontend/src/pages/ai/CharacterGenerate.tsx": "AI character generator page that allows users to create consistent character designs across multiple poses with customizable style, description, and consistency mode options.",
  "frontend/src/pages/ai/HDREnhance.tsx": "HDR enhancement tool for images and videos with adjustable intensity slider and tone mapping options (ACES, Reinhard, Filmic).",
  "frontend/src/pages/ai/HighlightDetect.tsx": "Video highlight detection page that analyzes uploaded videos using configurable criteria (loudness, motion, faces, scene-changes) to automatically identify key moments.",
  "frontend/src/pages/ai/HookGenerate.tsx": "AI-powered hook generator for creating attention-grabbing video openings based on video description, target audience, and hook style preferences.",
  "frontend/src/pages/ai/ImageGenerator.tsx": "React component for AI image generation with prompt input, size/style selection, and display of generated images. Uses useAIJob hook to submit 'image.generate' jobs with configurable parameters.",
  "frontend/src/pages/ai/LogoGenerate.tsx": "React component for AI logo generation with brand name, style, colors, and icon preferences inputs. Submits 'logo.generate' jobs and displays results in a grid layout.",
  "frontend/src/pages/ai/MotionAI.tsx": "React component for auto-generating keyframe animations on timeline clips. Allows selection of clip ID and animation property (position, scale, rotation, opacity) to submit 'motion.autoKeyframe' jobs.",
  "frontend/src/pages/ai/MusicGenerate.tsx": "React component for AI music generation with prompt, duration, BPM, genre, and mood controls. Submits 'music.generate' jobs with configurable parameters for custom audio track creation.",
  "frontend/src/pages/ai/StickerGenerate.tsx": "React component for AI sticker generation with prompt, style, size, and background options. Submits 'sticker.generate' jobs to create custom sticker images.",
  "frontend/src/pages/ai/TimelineAI.tsx": "React component for AI-powered timeline suggestions (cuts, effects, zooms) based on video URL input. Submits 'timeline.suggest' jobs with optional project ID for smart editing recommendations.",
  "frontend/src/pages/ai/TitleGenerate.tsx": "React component for generating video titles using AI, with inputs for video description, platform selection, tone, and keywords, displaying generated results with copy functionality.",
  "frontend/src/pages/ai/VideoGenerator.tsx": "React component for AI video generation from text prompts, allowing users to configure duration, aspect ratio (portrait/landscape/square), and view generated video results.",
  "frontend/src/pages/ai/VoiceClone.tsx": "React component for voice cloning that accepts audio file uploads and text scripts, with adjustable stability and similarity sliders to generate speech in a cloned voice.",
  "frontend/src/pages/ComingSoon.tsx": "Displays a styled \"Coming Soon\" placeholder page for features under development with navigation back to home.",
  "frontend/src/pages/Home.tsx": "Main landing page displaying categorized AI tools (Generation, Editing, Enhancement, Creator, Assistant, Growth, Experimental) with search, recent projects, and navigation to various AI features.",
  "frontend/src/pages/VideoEditor.tsx": "Main video editor page layout with toolbar, preview panel, inspector panel, timeline, project/export modals, AI assistant, and responsive navigation components.",
  "frontend/src/Router.tsx": "TanStack Router configuration defining routes for home, video editor, photo editor, and 50+ lazy-loaded AI tool pages across generation, editing, enhancement, creator, and growth categories.",
  "frontend/src/services/aiService.ts": "AI service layer providing provider configuration (ElevenLabs, Replicate, Runway, etc.), API request handling with retry logic and timeout management, plus mock AI functions for development.",
  "frontend/src/shaders/basic.glsl.ts": "Basic GLSL shader definitions with vertex shader for UV mapping and fragment shader for texture rendering with brightness adjustment.",
  "frontend/src/store/editorStore.ts": "Zustand store managing video editor state including timeline tracks, clips with keyframe transforms and effects, playback controls, and project loading/reset functionality.",
  "frontend/src/types/aiJob.ts": "Defines 50+ AIJobType variants across 8 categories (Generation, Editing, Enhancement, Creator, Assistant, Growth, Experimental AI) and their corresponding payload interfaces for all AI operations including image/video generation, voice cloning, subtitle animation, virality prediction, and more.",
  "frontend/src/types/aiTypes.ts": "Defines shared AI lifecycle types including AIJobStatus (queued/processing/completed/failed), AIJobResult interface, AIProvider types (mock/replicate/huggingface/custom), and helper interfaces for subtitles and cut points.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme including chart colors, teal/amber variants, custom animations (accordion), backdrop blur utilities, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document (v19) describing a professional video editor with unified architecture featuring timeline/keyframe/WebGL rendering engines, Motoko backend, comprehensive AI orchestration across 8 categories (50+ AI tools), CapCut-inspired UI with glassmorphism, and multi-format export capabilities."
}